//=============================================================================
//
// 空、滑走路処理 [field_sky.h]
// Author : HAL東京　GP11C295　樋沼　勇太
//
//=============================================================================
#ifndef _FIELD_SKY_H_
#define _FIELD_SKY_H_

#include "main.h"
#include "player.h"



//**************************************************************************
// マクロ定義
//**************************************************************************
#define TEXTURE_SKY		("data/TEXTURE/sky1.png")
#define TEXTURE_RUNWAY	("data/TEXTURE/Asphalt.png")

//*************キャラクターデータ変数の用意*****************************
#define		NUM_SKY	(1)

//*************モデルーデータ変数の用意*****************************
#define		NUM_SKYMODEL	(1)


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitFieldStar(void);
void UninitFieldStar(void);
void UpdateFieldStar(void);
void DrawFieldStarModel(void);


#endif
